export
const donationFields: Record<string, string> = {
  'Якщо у вас залишились коментарі/побажання, напишіть їх, будь ласка, нижче.': 'comments',
  "Ваш номер телефону, який прив'язаний до Telegram:\nПереживаємо, тому що інколи отримуємо заповнену анкету без контакту. Або ж нік, якого не існує. ": 'phone',
  "Орієнтовний зріст та параметри, на які жіночий одяг точно підійде (об'єм грудей, талії та стегон).\nПропустіть це питання, якщо ви не передаєте жіночий одяг": "female_clothes_params",
  "Якими дитячими товарами ви можете поділитись?\nПропустіть це питання, якщо не плануєте відправляти дитячі товари.\n\nНаприклад: мобіль, молоковідсмоктувач, ліжечко, стільчик для годування, візочок, автокрісло, самокат, велосипед, термоковрик, іграшки, книги та інше.": "kids_items",
  "Якою цифровою технікою ви можете поділитись?\nПропустіть це питання, якщо не плануєте відправляти техніку.\n\nНаприклад: телефон, смартфон, планшет, ноутбук та інше.": "tech_items",
  "Коли ви хочете зробити відправку речей?\nМи щодня опрацьовуємо велику кількість анкет, тому не зможемо вам написати відразу.": "preferred_time",
  "Які саме жіночі речі та в якій кількості ви зможете передати сім'ям?\nПропустіть це питання, якщо ви не передаєте жіночий одяг.\n\nПрохання написати в форматі:\nЖіночий одяг XL: джинсова куртка, осіння куртка, 3 сукні, футболки 5шт, спортивні штани, 3 спідниці. Це допоможе нам швидше розподілити ваші речі, так як одній жінці інколи відправляють одяг 2-3 відправники. І ми розуміємо, що хтось відправить джинси та кофти, а хтось - футболки. ": "female_clothes_items",
  "Напишіть європейський розмір жіночого взуття та довжину устілки в сантиметрах згідно розмірної таблиці нижче.\nЯкщо окрім одягу ви можете поділитись і взуттям": "female_shoe_sizes",
  "Орієнтовний зріст та параметри, на які чоловічий одяг точно підійде (об'єм грудей, талії та стегон).\nПропустіть це питання, якщо ви не передаєте чоловічий одяг": "male_clothes_params",
  "Розмір дитячого взуття та довжина устілки в сантиметрах.\nПрохання поміряти устілку, так як інколи в брендів відрізняється розмірна сітка.": "children_shoe_sizes",
  "Яким дитячим одягом ви можете поділитись?\nНа сьогоднішній день всіх новонароджених одягнули, тому одяг для найменших неактуальний.": "children_clothes_items",
  "Оберіть розмір наявного у вас чоловічого одягу згідно розмірної таблиці нижче": 'male_clothes_table_sizes',
  "Чи є в вас змога придбати щось додатково?\nПо кожному з пунктів ви орієнтуєтесь лише на свої фінансові можливості. Сім'ї в своїх запитах не пишуть конкретику. Вони взагалі не писали б ці пункти, так як просити їм соромно. Але ми включаємо ці пункти в анкету, тому що розуміємо, що купивши все відразу, це великий удар по бюджету тоді, коли ти позбувся дому та доходів.": 'extra_items',
  "Які саме чоловічі речі та в якій кількості ви зможете передати сім'ям?\nПропустіть це питання, якщо ви не передаєте чоловічий одяг.\n\nПрохання написати в форматі:\nЧоловічий одяг М: куртка-вітровка, 3 сорочки, футболки 5шт. Це допоможе нам швидше розподілити ваші речі, так як одному чоловікові інколи відправляють одяг 2-3 відправники. І ми розуміємо, що хтось відправить футболки та джинси, а хтось - худі та куртку. ": "male_clothes_items",
  "Якою побутовою технікою ви можете поділитись?\nПропустіть це питання, якщо не плануєте відправляти побутову техніку.\n\nНаприклад: фен, праска, електрочайник, блендер, мікрохвильова піч, мультиварка, тостер, плойка та інше.": "household_tech_items",
  "Timestamp": "timestamp",
  "Поверніться, будь ласка, на початок анкети і перевірте, чи ви вказали нік в телеграмі.\nПереживаємо, тому що інколи отримуємо заповнену анкету без контакту. Або ж нік, якого не існує. Якщо не знаєте ваш нік в телеграмі, просимо написати ваш номер телефону.": 'nickname',
  "Ваш номер телефону, який прив'язаний до Telegram:\nПереживаємо, тому що інколи отримуємо заповнену анкету без контакту. Або ж нік, якого не існує. \nМой ответ\n": 'phone_number',
  "Ваше ім'я": 'name',
  "Ви хочете поділитись речами в кількості:\n❗  Ми уточнюємо кількість для того, щоб зрозуміти, яка анкета для вас актуальна.\n\nЯкщо ви бажаєте поділитись, припустимо, лише феном та парою кросівок, ми відкриємо вам міні-анкету. Якщо ж ви бажаєте поділитись одягом дорослим та дитячим, і багатьма іншими речами, вам відкриється більша анкета. ": 'item_volume',
  "Оберіть розмір наявного у вас жіночого одягу згідно розмірної таблиці нижче": 'female_clothes_table_sizes',
  "На який зріст підійде цей одяг?\nЗріст важливий, так як до нас звертаються сім'ї, діти яких суттєво відрізняються по зросту в одному віці.": 'height',
  "Якими речами ви можете поділитись?\nПросимо написати чіткий перелік, вказуючи розміри та деталі, щоб ми дали вам контакт тієї сім'ї, якій потрібні саме ваші речі.\n\nНаприклад: жіноча куртка М, 1 банний рушник, двоспальний комплект постільної білизни, каструля 3л, чоловічі кросівки 43р (устілка 28 см) тощо ": 'item_list',
  "Якими побутовими речами ви можете поділитись?\nПропустіть це питання, якщо не плануєте відправляти побутові речі.\n\nНаприклад: рушники, постільна білизна, подушки, ковдри, пледи, посуд, каструлі, сковорідки та інше.\nДодатково просимо вказати розмір чи літраж.": 'household_items',
  "Ваш нік в Telegram\nКоли знайдемо сім'ї з відповідними потребами, ми напишемо вам в Telegram. Інші месенджери, на жаль, поки-що не підтримуємо. \n\nЗверніть увагу, що нік — це НЕ ваше ім'я в телеграмі. \nПобачити нік можна перейшовши у налаштування. \nНік починається з @\nПодпись отсутствует": 'telegram_nickname',
  "Напишіть європейський розмір наявного у вас чоловічого взуття та довжину устілки в сантиметрах згідно розмірної таблиці нижче.\nЯкщо окрім одягу ви можете поділитись і взуттям": 'male_shoe_sizes',
  "Коли ви хочете зробити відправку речей?\nМи щодня опрацьовуємо велику кількість анкет, тому не зможемо вам написати відразу. ": "preferred_delivery_date"
}

const petDonationFields: Record<string, string> = {
  "Ваш номер телефону, який прив'язаний до Telegram:\n\nПереживаємо, тому що інколи отримуємо заповнену анкету без контакту. Або ж нік, якого не існує. ": 'phone',
  "Я хочу:": 'intent',
  "Ваше ім'я:": 'name',
  "Якщо у вас залишились коментарі/побажання, напишіть їх, будь ласка, нижче.": 'comment',
  "Я планую придбати корму/товарів на суму:\nМи уточнюємо орієнтовну суму лише для того, щоб розуміти об'єм, який отримає кожна собачка та котик. Щоб розподілити чесно і не обділити жодну тваринку.": 'approximate_amount',
  "Timestamp": "timestamp",
  "Ваш нік в Telegram:\n\nЗверніть увагу, що нік — це НЕ ваше ім'я в телеграмі. \nПобачити нік можна перейшовши у налаштування. \n\nНік починається з @": 'nickname',
}

const requestFields: Record<string,string> = {
  'Дані для доставки Укрпоштою: \n\n- індекс\n- населений пункт та область (якщо вони відрізняються від тих, які ви вказали для відправки Новою поштою)': 'post_details',
  'На який сезон потрібен дитячий одяг': 'children_clothes_season',
  'Склад вашої сім’ї, кому потрібна допомога': 'family_members',
  'Якщо ви евакуювались разом зі своїми домашніми улюбленцями, просимо написати:\n\n- імена та вік кожного\n- стерилізовані чи ні\n- який корм люблять (сухий/вологий, марка корму)\n- чи потрібно щось додатково, окрім корму': 'pets',
  'Якщо ми знайдемо додатковий одяг необхідного розміру, окрім вказаного вами в переліку, він не буде зайвим?': 'accept_extra_clothes',
  'Можливо, потрібно щось додатково? Наприклад: засоби гігієни, продуктовий набір, побутова хімія, ковдри, постільна білизна, фен, побутові речі і т.п.  ': 'accept_extra_items',
  'Можливо, потрібно щось додатково? Засоби гігієни, продукти, ковдри, постільна білизна, побутова хімія, фен, побутові речі і т.п. ': 'accept_extra_items_2',
  'На який сезон потрібен чоловічий одяг?': 'male_clothes_season',
  'З якого населеного пункту ви були вимушені виїхати?': 'locality',
  'Стать та вік, на який потрібен дитячий одяг': 'children_params',
  'Яку допомогу потребуєте?': 'help_requirements',
  'Timestamp': 'help_requirements',
  "Ваше ім'я": 'name',
  "Оберіть розмір необхідного чоловічого одягу згідно розмірної таблиці нижче": 'male_clothes_table_sizes',
  "Якщо для вас актуальний одяг/взуття, напишіть дані по кожному члену сім'ї, кому він потрібен.\n\nОбов’язково: \n- ім'я, вік\n- зріст\n- розмір одягу згідно таблиць вище\n- параметри (обхват грудей/обхват талії/обхват стегон)\n- розмір взуття (обов’язково з довжиною устілки в сантиметрах)\n- сезон, на який потрібні речі": 'clothes_family_member_params',
  "Напишіть дані по кожному члену сім'ї, кому потрібен одяг або взуття в такому вигляді, як на картинці нижче.\nОбов’язково: вік, зріст, розмір одягу згідно таблиць вище, параметри (ОГ/ОТ/ОС) та розмір взуття (обов’язково з довжиною устілки в сантиметрах).": 'clothes_family_member_params_2',
  "Можливо, у вас будуть додаткові уточнення, коментарі чи побажання?": 'comments',
  "Чи є у вас Telegram? Вкажіть, будь ласка, номер телефону, на який зареєстрований Telegram, а також ваш нік.\n\nЗверніть увагу, що нік — це НЕ ваше ім'я в телеграмі. \n\nПобачити нік можна, перейшовши у налаштування. \nНік починається з @": 'nickname',
  "Ваш нік в Instagram чи посилання на вашу сторінку в Instagram": 'instagram_nickname',
  "Дані для для доставки Новою Поштою:\n\n- місто, область\n- номер відділення нової пошти\n- прізвище, ім'я, по-батькові отримувача\n- номер телефону ": 'nova_post_details',
  "На який сезон потрібен жіночий одяг?": 'female_clothes_season',
  "Оберіть розмір необхідного жіночого одягу згідно розмірної таблиці нижче": 'female_clothes_table_sizes',
}

export const mapFormFieldsToInternalFields = (type: string, fields: Record<string, string>) => {
  const dictionary = {
    donation: donationFields,
    'pet-donation': petDonationFields,
    request: requestFields
  }[type];

  if(dictionary) {
    return Object.entries(fields).reduce<Record<string, any>>((obj, [key, value]) => {
      const internalKey = dictionary[key];
      if(internalKey) {
        obj[internalKey] = value
      }

      return obj;
    }, {})
  }

}
